[
    {
        "id": 1,
        "finalLogo": "/images/graphics/blossom/final_logo.png",
        "CompanyName": "Blossom delight",
        "Category/Mascot": "Pastry Shop / Bumblebee",
        "Target Audience": "Typically between the ages of 18 to 35 and are drawn to the contemporary,modern atmosphere of the brand.",
        "Emotional details": "Fun, cute, trendy",
        "visual research photos": "/images/graphics/blossom/visualPhotos.png",
        "visual research mascot": "/images/graphics/blossom/mascot.png",
        "symbol sketches part1": "/images/graphics/blossom/sketches.png",
        "symbol sketches part2": "/images/graphics/blossom/symbolsketches.png",
        "direction 1": "For the first direction I tried to create a more dynamic design while maintaining simplicity, ensuring the mascot remained integrated rather than isolated.",
        "direction 2": "For the second direction I wanted to make something more fun. I incorporate more symbols like the chef’s hat. I also tried different ways of designing the bread so it could be better associated with the mascot.",
        "direction 3": "For the last one I had a more simple approach by associating straightforward symbols.",
        "digitized logos": "/images/graphics/blossom/digitized.png",
        "digitized logos refinements": "/images/graphics/blossom/refinements.png",
        "first logo": "I refined the shapes and enlarged the outline to eliminate the stroke for a cleaner look. I also incorporated the hat into the design, as I think it is a significant symbol that not only adds character but also cohesively ties all the elements together.",
        "second logo": "I also refined the shapes for this desing, transforming the outline strokes into more distinct forms. This process made the symbols, such as the bread and the wings of the bumblebee, much clearer and more recognizable. These changes enhanced the overall clarity and impact of these elements, as well as the design’s cohesive visual narrative.",
        "third logo": "I refined the wings and the overall shape of the mascot in order to improve the its visual appeal and coherence of the design. Additionally, I incorporated detailed elements into the circle, so the design has more symbols that represent the business.",
        "type variations": "/images/graphics/blossom/variations.png",
        "final directions": "/images/graphics/blossom/finaldir.png",
        "1st version": "Based on the feedback I received, I simplified my logo by reducing the size of the cupcake, allowing the mascot to become the central focus. This adjustment helped me to enhance the clarity and impact of the logo.",
        "2nd version": "For this direction I choose to simplify the design even more by only keeping the mascot, as it embodies the most distinctive symbols of the brand. Based on the feedback I received, I opted for a bolder font to go along and compliment the roundess of the design.",
        "3rd version": "I refined the previous design by selecting a new font that better aligns with the desired brand aesthetic and feel. To enhance the brand’s friendly and accessible personality, I opted for all lowercase lettering. I centered the text and incorporated elements of the earlier cupcake design, particularly around the ‘o’ to add visual interest and ensure the symbols of the brand stand out more prominently.",
        "mockup": "/images/graphics/blossom/signature.png"
    }
]